{
    "education": [
        {
            "degree": "B.Tech (Computer Engineering)",
            "university": "Delhi Technological University",
            "location": "Delhi, India",
            "year": "July 2021"
        }
    ],
    "experience": [
        {
            "title": "Research and Development Engineer",
            "company": "Tejas Networks Ltd.",
            "location": "Gurugram, Haryana, India",
            "duration": "July 2021 - Present",
            "description": [
                "Added enhancements to QoS for carrier Ethernet networks in TejNMS, minimizing disruptions and boosting network performance by 25%.",
                "Streamlined provisioning of Circuit Emulated networks across multiple platforms, resulting in a 40% reduction in provisioning time and a 20% increase in network efficiency through process optimization and automation.",
                "Introduced automated regression testing (Selenium + TestNG), cutting testing efforts by 60% and ensuring 90% test coverage.",
                "Successfully migrated TejNMS codebase to Git, elevating code collaboration efficiency by 50% and minimizing version control conflicts.",
                "Developed user-friendly graphical interface for BGP and RSVP configuration, streamlining setup time by 35% and reducing user errors by 90%.",
                "Designed modern graphical display of administrative domain routers, enhancing network management efficiency by 40%."
            ]
        },
        {
            "title": "R & D Engineer Intern",
            "company": "Tejas Networks Ltd.",
            "location": "Gurugram, Haryana, India",
            "duration": "January 2021 - July 2021",
            "description": [
                "Analyzed TejNMS codebase, achieving a 30% reduction in code redundancy through the implementation of DHTMLX library functions.",
                "Enhanced code quality by re-factoring methods, resulting in a 40% improvement in code maintainability.",
                "Introduced best practices for JavaScript, leading to 25% reduction in bugs and enhancing overall code reliability.",
                "Improved user experience by implementing asynchronous calls and procedures, resulting in a 50% reduction in loading times and enhancing app responsiveness."
            ]
        },
        {
            "title": "Front-end Developer Intern",
            "company": "Stepswatch",
            "location": "India",
            "duration": "March 2020 - May 2020",
            "description": [
                "Spearheaded the creation of Stepswatch mobile app using React Native, reducing time-to-market by 30%.",
                "Achieved secure user sessions and data protection with Redux and JWT, maintaining a 99% success rate in safeguarding user data.",
                "Implemented real-time chat via socket.io, ensuring 98% uptime for instant communication within the app."
            ]
        },
        {
            "title": "University Student Intern",
            "company": "Delhi Technological University",
            "location": "Delhi, India",
            "duration": "August 2019 - March 2020",
            "description": [
                "Led the design and development of Intellectual Property Rights (IPR) Cell, DTU website, achieving a 40% reduction in loading time for enhanced user experience <a href=\"https://mohitr1999.github.io/iprCellWebsite/\" color=\"blue\">(Link)</a>.",
                "Managed the deployment of IPR Cell website on Microsoft Azure, ensuring 99.9% uptime and accessibility.",
                "Designed and developed the website for International Summit on Quality Indices in Higher Education, resulting in a 50% increase in user engagement during the summit."
            ]
        }
    ],
    "skills": [
        "Programming Languages: Javascript, C++, Python",
        "Programming concepts: Object Oriented Programming, Data structures and algorithms, Computer Networks",
        "Frameworks and Libraries: React.js, React Native, Redux, Selenium, socket.io"
    ],

    "projects" : [
        {
            "title" : "C Compiler in Javascript",
            "description" : "A C compiler, written purely in Javascript from scratch <a href=\"https://github.com/MohitR1999/compiler-in-javascript\" color=\"blue\">(GitHub)</a>",
            "link" : "<a href=\"https://github.com/MohitR1999/compiler-in-javascript\" color=\"blue\">(GitHub)</a>"
        },

        {
            "title" : "Vitarit File Pranali",
            "description" : "A distributed file system implemented using python and rpyc <a href=\"https://github.com/MohitR1999/vitarit-file-pranali\" color=\"blue\">(GitHub)</a>",
            "link" : "<a href=\"https://github.com/MohitR1999/vitarit-file-pranali\" color=\"blue\">(GitHub)</a>"
        },

        {
            "title" : "Maestro-bot",
            "description" : "A Discord bot, that shows you memes and pictures as you say <a href=\"https://github.com/MohitR1999/maestro-bot\" color=\"blue\">(GitHub)</a>",
            "link" : "<a href=\"https://github.com/MohitR1999/maestro-bot\" color=\"blue\">(GitHub)</a>"
        }
    ]
}