{
    "education": [
        {
            "degree": "B.Tech (Computer Engineering)",
            "university": "Delhi Technological University",
            "location": "Delhi, India",
            "year": "August 2017 - July 2021"
        }
    ],
    "experience": [
        {
            "title": "Research and Development Engineer",
            "company": "Tejas Networks Ltd.",
            "location": "Gurugram, Haryana, India",
            "duration": "July 2021 - Present",
            "description": [
                "Added multiple enhancements to management of QoS (Quality of Service) during provisioning of carrier ethernet networks from TejNMS, minimizing disruptions and boosting network performance by 25%.",
                "Streamlined provisioning of Circuit Emulated networks across multiple platforms, resulting in a 40% reduction in provisioning time and a 20% increase in network efficiency through process optimization and automation.",
                "Introduced automated regression testing (Selenium + TestNG), cutting testing efforts by 60% and ensuring 90% test coverage.",
                "Orchestrated the seamless transition of the TejNMS codebase from CVS to Git, resulting in a 50% improvement in code collaboration efficiency and a significant reduction in version control conflicts.",
                "Developed user-friendly graphical interfaces for BGP and RSVP configuration, streamlining setup time by 35% and reducing user errors by 90%.",
                "Developed an intuitive network visualization solution for managing the ISP's administrative domain, using cytoscape.js, enhancing user experience and reducing errors by 50%."
            ]
        },
        {
            "title": "R & D Engineer Intern",
            "company": "Tejas Networks Ltd.",
            "location": "Gurugram, Haryana, India",
            "duration": "January 2021 - July 2021",
            "description": [
                "Analyzed TejNMS codebase, achieving a 30% reduction in code redundancy through the implementation of DHTMLX library functions.",
                "Enhanced code quality by re-factoring methods, resulting in a 40% improvement in code maintainability.",
                "Introduced best practices for JavaScript, leading to 25% reduction in bugs and enhancing overall code reliability.",
                "Improved user experience by implementing asynchronous calls and procedures, resulting in a 50% reduction in loading times and enhancing app responsiveness."
            ]
        },
        {
            "title": "Front-end Developer Intern",
            "company": "Stepswatch",
            "location": "India",
            "duration": "March 2020 - May 2020",
            "description": [
                "Spearheaded the creation of Stepswatch mobile app using React Native, reducing time-to-market by 30%.",
                "Achieved secure user sessions and data protection with Redux and JWT, maintaining a 99% success rate in safeguarding user data.",
                "Implemented real-time chat via socket.io, ensuring 98% uptime for instant communication within the app."
            ]
        }
    ],
    "skills": [
        "Programming Languages: Javascript, C++, Python",
        "Programming concepts: Object Oriented Programming, Data structures and algorithms, Computer Networks",
        "Frameworks and Libraries: React.js, React Native, Redux, Selenium, socket.io, reportlab, cytoscape.js"
    ],

    "projects" : [
        {
            "title" : "Resume generator",
            "description" : "Developed a user-friendly resume generator in Python, designed to be ATS-friendly, configurable, and effortlessly usable. This resume itself was generated using the tool.",
            "link" : "<a href=\"https://github.com/MohitR1999/ats-friendly-resume\" color=\"blue\">(GitHub)</a>"
        },
        
        {
            "title" : "Compiler in Javascript",
            "description" : "Created a comprehensive C compiler from scratch in JavaScript, effectively illustrating the core phases of compiling a C source file into its assembly equivalent.",
            "link" : "<a href=\"https://github.com/MohitR1999/compiler-in-javascript\" color=\"blue\">(GitHub)</a>"
        },

        {
            "title" : "Website for IPR Cell, DTU",
            "description" : "Constructed an engaging, Bootstrap-powered website for DTU's Intellectual Property Rights Cell.",
            "link" : "<a href=\"https://mohitr1999.github.io/iprCellWebsite\" color=\"blue\">(Link)</a>"
        },

        {
            "title" : "Vitarit File Pranali",
            "description" : "Implemented a distributed file system using Python and rpyc, demonstrating the foundational concepts of replication and redundancy.",
            "link" : "<a href=\"https://github.com/MohitR1999/vitarit-file-pranali\" color=\"blue\">(GitHub)</a>"
        },

        {
            "title" : "Maestro-bot",
            "description" : "Developed a flexible Discord bot enabling instant meme and image retrieval, enhancing platform engagement.",
            "link" : "<a href=\"https://github.com/MohitR1999/maestro-bot\" color=\"blue\">(GitHub)</a>"
        }
    ]
}