{
    "education": [
        {
            "course": "B.Tech (Computer Engineering), CGPA - 8.36",
            "institution": "Delhi Technological University",
            "location": "Delhi, India",
            "start_date": "August 2017",
            "end_date": "July 2021"
        }
    ],
    "experience": [
        {
            "title": "Senior Engineer",
            "company": "Tejas Networks Ltd.",
            "location": "Gurugram, Haryana, India",
            "start_date": "April 2024",
            "end_date": "Present",
            "description": [
                "Led the complete architecture design and development of network visualization microservice for BSNL's MPLS-IP based Access and Aggregation Network (MAAN), the backbone for pan India BSNL 4G rollout, using React.js, Cytoscape.js and Express framework",
                "Developed the Border Gateway Protocol (BGP) configuration microservice conforming to the Open Networking Foundation's Transport API (TAPI) and REST standards.",
                "Devised an efficient report generation utility for resource utilization within a network using Highcharts.js, enabling administrators for efficient monitoring and management of devices.",
                "Orchestrated the seamless transition of the TejNMS codebase from CVS to Git, resulting in a 50% improvement in collaboration efficiency and a significant reduction in version control conflicts."
            ]
        },
        {
            "title": "Research and Development Engineer",
            "company": "Tejas Networks Ltd.",
            "location": "Gurugram, Haryana, India",
            "start_date": "July 2021",
            "end_date": "April 2024",
            "description": [
                "Successfully ported the legacy Java Swing based applet UI to modern javascript-based UI using React.js and DHTMLX, reducing the app loading time from 30 seconds to 3 seconds.",
                "Created user-friendly GUI for RSVP (Resource Reservation Protocol) configuration, cutting down provisioning time from 5 minutes to 1 minute.",
                "Introduced automated regression testing using Selenium and TestNG, cutting testing efforts by 60% and ensuring 90% test coverage."
            ]
        },
        {
            "title": "R & D Engineer Intern",
            "company": "Tejas Networks Ltd.",
            "location": "Gurugram, Haryana, India",
            "start_date": "January 2021",
            "end_date": "July 2021",
            "description": [
                "Improved user experience by implementing asynchronous calls using promises in javascript, resulting in a 50% reduction in loading times and enhancing app responsiveness.",
                "Restructured the UI codebase, achieving a 30% reduction in redundancy through the implementation of DHTMLX library functions.",
                "Enhanced code quality by re-factoring methods, resulting in a 40% improvement in maintainability.",
                "Introduced best practices for JavaScript, leading to 25% reduction in bugs and enhancing overall code reliability."
            ]
        },
        {
            "title": "Mobile Frontend Software Engineer Intern",
            "company": "Stepswatch",
            "location": "India",
            "start_date": "March 2020",
            "end_date": "May 2020",
            "description": [
                "Spearheaded the UI development of Stepswatch mobile app based on flux architecture, using React Native and Redux for the frontend, Express server for backend and mongoDB as the database.",
                "Achieved secure user sessions and data protection with JWT and in-house authentication mechanisms, maintaining a 99% success rate in safeguarding user data.",
                "Implemented real-time chat via socket.io, ensuring 98% uptime for instant communication within the app."
            ]
        }
    ],
    "skills": [
        {
            "title" : "Programming Languages and tools",
            "elements" : [
                "JavaScript",
                "C++",
                "Java",
                "Python",
                "Linux",
                "Git"
            ]
        },

        {
            "title" : "Databases",
            "elements" : [
                "MySQL",
                "MongoDB"
            ]
        },

        {
            "title" : "Cloud",
            "elements" : [
                "Microsoft Azure",
                "GCP"
            ]
        },

        {
            "title" : "Frameworks and Libraries",
            "elements" : [
                "React.js",
                "React Native",
                "Redux",
                "Express",
                "Node.js",
                "Selenium",
                "socket.io",
                "cytoscape.js",
                "spring",
                "spring boot"
            ]
        }
    ],
    "projects": [
        {
            "title": "Resume generator",
            "description": "Developed a user-friendly resume generator in Python, designed to be ATS-friendly, configurable, and effortlessly usable. This resume was generated using the tool.",
            "link": "<a href=\"https://github.com/MohitR1999/ats-friendly-resume\" color=\"blue\">(GitHub)</a>"
        },
        {
            "title": "Vitarit File Pranali",
            "description": "Implemented a distributed file system using Python and rpyc, demonstrating the foundational concepts of data replication and redundancy.",
            "link": "<a href=\"https://github.com/MohitR1999/vitarit-file-pranali\" color=\"blue\">(GitHub)</a>"
        },
        {
            "title": "Maestro-bot",
            "description": "Devised a flexible Discord bot enabling instant meme and image retrieval, enhancing platform engagement.",
            "link": "<a href=\"https://github.com/MohitR1999/maestro-bot\" color=\"blue\">(GitHub)</a>"
        }
    ]
}