{
    "education": [
        {
            "course": "B.Tech (Computer Engineering), CGPA - 8.36",
            "institution": "Delhi Technological University",
            "location": "Delhi, India",
            "start_date": "August 2017",
            "end_date": "July 2021"
        }
    ],
    "experience": [
        {
            "title": "Senior Engineer",
            "company": "Tejas Networks Ltd.",
            "location": "Gurugram, Haryana, India",
            "start_date": "April 2024",
            "end_date": "Present",
            "description": [
                "Led the complete architecture design and development of network visualization microservice for BSNL's MPLS-IP based Access and Aggregation Network (MAAN), the backbone for pan India BSNL 4G rollout, using React.js, Cytoscape.js and Express framework.",
                "Developed microservices for configuration of BGP and RSVP protocols using Spring Boot, adhering to ONF's TAPI and REST standards, contributing to scalable network solutions.",
                "Devised an efficient report generation utility for resource utilization within a network using Highcharts.js, enabling administrators for efficient monitoring and management of devices.",
                "Guided cross-functional teams in transitioning version control systems from CVS to Git, improving collaboration efficiency by 50%."
            ]
        },
        {
            "title": "Research and Development Engineer",
            "company": "Tejas Networks Ltd.",
            "location": "Gurugram, Haryana, India",
            "start_date": "July 2021",
            "end_date": "April 2024",
            "description": [
                "Led front-end modernization, transitioning legacy Java Swing-based UI to modern React.js architecture with Redux and Material UI, improving load times from 30 seconds to 3 seconds.",
                "Introduced automated regression testing using Selenium and TestNG, cutting testing efforts by 60% and ensuring 90% test coverage."
            ]
        },
        {
            "title": "R & D Engineer Intern",
            "company": "Tejas Networks Ltd.",
            "location": "Gurugram, Haryana, India",
            "start_date": "January 2021",
            "end_date": "July 2021",
            "description": [
                "Orchestrated multiple network element simulators using Docker, enabling seamless simulation environments for efficient development and testing.",
                "Worked closely with backend engineers, product managers, and UI/UX designers to deliver cohesive solutions across all stages of the SDLC.",
                "Improved user experience by implementing asynchronous calls using promises in javascript, reducing overall application loading time from 10 to 0.5 seconds."
            ]
        },
        {
            "title": "Mobile Frontend Software Engineer Intern",
            "company": "Stepswatch",
            "location": "India",
            "start_date": "March 2020",
            "end_date": "May 2020",
            "description": [
                "Led the UI development of Stepswatch mobile app based on Flux architecture using React Native and Redux achieving intuitive and performant interfaces.",
                "Implemented fail-safe handling of network requests' side effects using Redux Thunk.",
                "Built backend microservices, including a real-time chat feature, with Socket.io, ensuring 98% uptime for instant communication.",
                "Secured user data by implementing JWT-based authentication within Express microservices, maintaining a 99% success rate in safeguarding information."
            ]
        }
    ],
    "skills": [
        {
            "title" : "Programming Languages",
            "elements" : [
                "JavaScript",
                "C++",
                "Java",
                "Python"
            ]
        },
        {
            "title" : "Frameworks and Libraries",
            "elements" : [
                "React.js",
                "React Native",
                "Redux",
                "Express",
                "Node.js",
                "Selenium",
                "socket.io",
                "Spring",
                "Spring boot"
            ]
        },

        {
            "title" : "Tools",
            "elements" : [
                "Docker",
                "Git",
                "Jira",
                "Linux",
                "CVS"
            ]
        },

        {
            "title" : "Databases",
            "elements" : [
                "MySQL",
                "MongoDB"
            ]
        },

        {
            "title" : "Cloud",
            "elements" : [
                "Microsoft Azure",
                "GCP",
                "AWS"
            ]
        }
    ],
    "projects": [
        {
            "title": "Blog portal (In progress)",
            "description": "A blog management and reading portal, based on microservices architecture, built using MERN stack with Nginx as reverse proxy, and being tracked using GitHub Projects. Currently having <a href=\"https://github.com/MohitR1999/portfolio-auth-microservice/\" color=\"blue\">Authentication microservice</a> and <a href=\"https://github.com/MohitR1999/portfolio-blog-microservice/\" color=\"blue\">Blog microservice</a>. ",
            "link": "<a href=\"https://github.com/MohitR1999/portfolio-service\" color=\"blue\">(GitHub Monorepo)</a>"
        },
        {
            "title": "Resume generator",
            "description": "Developed a user-friendly resume generator in Python, designed to be ATS-friendly, configurable, and effortlessly usable. This resume was generated using the tool.",
            "link": "<a href=\"https://github.com/MohitR1999/ats-friendly-resume\" color=\"blue\">(GitHub)</a>"
        },
        {
            "title": "Vitarit File Pranali",
            "description": "Implemented a distributed file system using Python and rpyc, demonstrating the foundational concepts of data replication and redundancy.",
            "link": "<a href=\"https://github.com/MohitR1999/vitarit-file-pranali\" color=\"blue\">(GitHub)</a>"
        }
    ]
}